<?php

/**
 * 公历
 */
class Solar
{
    // 某月的第几个星期几,如第2个星期一指从月首开始顺序找到第2个“星期一”
    private static $wFtv = [ 
        // 一月的最后一个星期日（月倒数第一个星期日）
        '0150I世界麻风日', 
        '0520.国际母亲节',
        '0530I全国助残日',
        '0630.父亲节',
        '0730.被奴役国家周',
        '0932I国际和平日',
        '0940.国际聋人节 世界儿童日',
        '0950I世界海事日',
        '1011.国际住房日',
        '1013I国际减轻自然灾害日(减灾日)',
        '1144I感恩节',
    ];

    // 国历节日, #表示放假日, I表示重要节日或纪念日
    private static $sFtv = [
        // 1月
        ['01#元旦'],
        // 2月
        ['02I世界湿地日', '10.国际气象节', '14I情人节'],
        // 3月
        ['01.国际海豹日', '03.全国爱耳日', '05.1963-9999学雷锋纪念日', '08I妇女节', '12I植树节', '12.1925-9999孙中山逝世纪念日', '14.国际警察日', '15I1983-9999消费者权益日', '17.中国国医节', '17.国际航海日', '21.世界森林日', '21.消除种族歧视国际日', '21.世界儿歌日', '22I世界水日', '23I世界气象日', '24.1982-9999世界防治结核病日', '25.全国中小学生安全教育日', '30.巴勒斯坦国土日'],
        // 4月
        ['01I1564-9999愚人节', '01.全国爱国卫生运动月(四月)', '01.税收宣传月(四月)', '07I世界卫生日', '22I世界地球日', '23.世界图书和版权日', '24.亚非新闻工作者日'],
        // 5月
        ['01#1889-9999劳动节', '04I青年节', '05.碘缺乏病防治日', '08.世界红十字日', '12I国际护士节', '15I国际家庭日', '17.国际电信日', '18.国际博物馆日', '20.全国学生营养日', '23.国际牛奶日', '31I世界无烟日'],
        // 6月
        ['01I1925-9999国际儿童节', '05.世界环境保护日', '06.全国爱眼日', '17.防治荒漠化和干旱日', '23.国际奥林匹克日', '25.全国土地日', '26I国际禁毒日'],
        // 7月
        ['01I1997-9999香港回归纪念日', '01I1921-9999中共诞辰', '01.世界建筑日', '02.国际体育记者日', '07I1937-9999抗日战争纪念日', '11I世界人口日', '30.非洲妇女日'],
        // 8月
        ['01I1927-9999建军节', '08.中国男子节(爸爸节)'],
        // 9月
        ['03I1945-9999抗日战争胜利纪念', '08.1966-9999国际扫盲日', '08.国际新闻工作者日', '09.毛泽东逝世纪念', '10I中国教师节', '14.世界清洁地球日', '16.国际臭氧层保护日', '18I九·一八事变纪念日', '20.国际爱牙日', '27.世界旅游日', '28I孔子诞辰'],
        // 10月
        ['01#1949-9999国庆节', '01.世界音乐日', '01.国际老人节', '02#1949-9999国庆节假日', '02.国际和平与民主自由斗争日', '03#1949-9999国庆节假日', '04.世界动物日', '06.老人节', '08.全国高血压日', '08.世界视觉日', '09.世界邮政日', '09.万国邮联日', '10I辛亥革命纪念日', '10.世界精神卫生日', '13.世界保健日', '13.国际教师节', '14.世界标准日', '15.国际盲人节(白手杖节)', '16.世界粮食日', '17.世界消除贫困日', '22.世界传统医药日', '24.联合国日', '31.世界勤俭日'],
        // 11月
        ['07.1917-9999十月社会主义革命纪念日', '08.中国记者日', '09.全国消防安全宣传教育日', '10.世界青年节', '11.国际科学与和平周(本日所属的一周)', '12.孙中山诞辰纪念日', '14.世界糖尿病日', '17.国际大学生节', '17.世界学生节', '20.彝族年', '21.彝族年', '21.世界问候日', '21.世界电视日', '22.彝族年', '29.国际声援巴勒斯坦人民国际日'],
        // 12月
        ['01I1988-9999世界艾滋病日', '03.世界残疾人日', '05.国际经济和社会发展志愿人员日', '08.国际儿童电视日', '09.世界足球日', '10.世界人权日', '12I西安事变纪念日', '13I南京大屠杀(1937年)纪念日', '20.澳门回归纪念', '21.国际篮球日', '24I平安夜', '25I圣诞节', '26.毛泽东诞辰纪念'],
    ];

    /**
     * 取某日节日, 传入日对象
     * 
     * 节日名称生成
     * 传入日物件u 
     * 返回某日节日信息
     * 
     * r.A 重要喜庆日子名称(可将日子名称置红)
     * r.B 重要日子名称
     * r.C 各种日子名称(连成一大串)
     * r.Fjia 放假日子(可用于日期数字置红)
     */
    public static function getDayName($u, $r)
    {
        $m0 = ($u->m < 10 ? '0' : '') . $u->m;
        $d0 = ($u->d < 10 ? '0' : '') . $u->d;
      
        // 星期日或星期六放假
        if ($u->week === 0 || $u->week === 6) {
            $r->Fjia = 1;
        }
      
        // 按公历日期查找
        $mFtv = self::$sFtv[ $u->m-1 ];
        $length = count($mFtv);

        // 公历节日或纪念日, 遍历本月节日表
        for ($i = 0; $i < $length; $i++)
        {
            $s = $mFtv[$i];
            if (substr($s, 0, 2) !== $d0) {
                continue;
            }

            $s    = substr($s, 2, strlen($s)-2);
            $type = substr($s, 0, 1);

            if (substr($s, 5, 1) === '-') {
                // 有年限的
                if ( $u->y<(substr($s, 1, 4)-0) || $u->y>(substr($s, 6, 4)-0) ) {
                    continue;
                }
                $s = substr($s, 10, strlen($s)-10);
            } else {
                if ($u->y<1850) {
                    continue;
                }
                $s = substr($s, 1, strlen($s)-1);
            }

            // 放假的节日
            if ($type === '#') {
                $r->A += $s + ' ';
                $r->Fjia = 1;
            }
            // 主要
            if ($type === 'I') {
                $r->B += $s + ' '; 
            }
            // 其它
            if ($type === '.') {
                $r->C += $s + ' '; 
            }
        }

        // 按周查找
        $w = $u->weeki;
        if ($u->week >= $u->week0) {
            $w += 1;
        }
        
        $w2 = $w;
        if ($u->weeki == $u->weekN - 1) {
            $w2 = 5;
        }

        // d日在本月的第几个星期某
        $w  = $m0 + $w  + $u->week;
        $w2 = $m0 + $w2 + $u->week;

        $length = count(self::$wFtv);
        for ($i = 0; $i < $length; $i++)
        {
            $s  = self::$wFtv[$i];
            $s2 = substr($s, 0, 4);
            
            if ($s2 !== $w && $s2 !== $w2) {
                continue;
            }

            $type = substr($s, 4, 1);
            $s    = substr($s, 5, strlen($s)-5);

            // 放假的节日
            if ($type === '#') {
                $r->A += $s + ' ';
                $r->Fjia = 1;
            }
            // 主要
            if ($type === 'I') {
                $r->B += $s + ' '; 
            }
            // 其它
            if ($type === '.') {
                $r->C += $s + ' '; 
            }
        }
    }

    /**
     * 回历计算
     * 以下算法使用Excel测试得到, 测试时主要关心年临界与月临界
     */
    public static function getHuiLi($d0, $r)
    {
        // 10631为一周期(30年)
        $d = $d0 + 503105;
        $z = int2( $d/10631 );       

        // 加0.5的作用是保证闰年正确(一周中的闰年是第2,5,7,10,13,16,18,21,24,26,29年)
        $d -= $z*10631;
        $y  = int2(($d+0.5)/354.366); 

        // 分子加0.11,分母加0.01的作用是第354或355天的的月分保持为12月(m=11)
        $d -= int2($y*354.366+0.5);
        $m  = int2(($d+0.11)/29.51);  

        $d -= int2($m*29.5+0.5);

        $r->Hyear = $z*30+$y+1;
        $r->Hmonth= $m+1;
        $r->Hday  = $d+1;
    }
}